areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c-sagitta-03.h
// Function declarations of port pin RB2
#if defined (_TRISB2)
static const P33C_GPIO_t PIN_RB2 = {
    .Properties.Port         = 1,                       ///< Index of device port this device pin is part of (0=A, 1=B, 2=C, 3=D, etc), =-1 if not available
    .Properties.Pin          = 2,                       ///< Index of device pin within its device port (0-15), =-1 if not available
    .Properties.RPid         = 34,                      ///< Remappable Pin ID of this device pin, =-1 if not available
    .Properties.ADCAN        = 1,                       ///< Index of ADC input instance available at this device pin, =-1 if not available
    .Properties.ADCORE       = 1,                       ///< Index of ADC core connected to analog input of this pin, valid range: 0 to 7, =-1 if not available
    .Properties.CMPxIN       = 3,                       ///< Index of comparator input multiplexer channel available at this pin (0=A, 1=B, 2=C, 3=D), =-1 if not available
    .Properties.DAC          = 2,                       ///< Index of DAC instance available at this device pin, =-1 if not available
    .Properties.I2C          = 3,                       ///< Index of I2C peripheral instance available at this device pin, =-1 if not available
    .Properties.OPA          = 2,                       ///< Index of Op-Amp peripheral instance available at this device pin, =-1 if not available
    .Properties.PGA          = -1,                      ///< (not available)
    .Properties.PG           = -1,                      ///< (not available)
    .Properties.SPI          = -1,                      ///< (not available)
    #ifdef DAC2CONL
    .Objects.DAC             = (P33C_DAC_INSTANCE_t*)&DAC2CONL, ///< Pointer to DAC/Comparator instance data object available at this device pin
    #else
    .Objects.DAC             = NULL,                    ///< (not available)
    #endif
    #ifdef I2C3CONL
    .Objects.I2C             = (P33C_I2C_INSTANCE_t*)&I2C3CONL, ///< Pointer to I2C interface peripheral instance data object available at this device pin
    #else
    .Objects.I2C             = NULL,                    ///< (not available)
    #endif
    #ifdef AMPCON2L
    .Objects.OPA             = (P33C_OPA_INSTANCE_t*)&AMPCON2L, ///< Pointer to Op-Amp instance data object available at this device pin
    #else
    .Objects.OPA             = NULL,                    ///< (not available)
    #endif
    #if (P33C_PGA_COUNT > 0)
    .Objects.PGA             = NULL,                    ///< Pointer to Programmable Gain Amplifier instance data object available at this device pin
    #endif
    #if (P33C_PG_COUNT > 0)
    .Objects.PG              = NULL,                    ///< Pointer to PWM Generator peripheral instance data object available at this device pin
    #endif
    #if (P33C_SPI_COUNT > 0)
    .Objects.SPI             = NULL,                    ///< Pointer to SPI interface peripheral instance data object available at this device pin
    #endif
    .Methods.Get            = &__builtin_RB2_Get,       ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
    .Methods.Set            = &__builtin_RB2_Set,       ///< Sets the most recent pin state to logic HIGH
    .Methods.Clear          = &__builtin_RB2_Clear,     ///< Sets the most recent pin state to logic LOW
    .Methods.Toggle         = &__builtin_RB2_Toggle,    ///< Toggles the most recent pin state
    .Methods.SetInput       = &__builtin_RB2_SetInput,  ///< Sets the pin direction to high impedance input (no state change)
    .Methods.SetOutput      = &__builtin_RB2_SetOutput, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.SetState       = &__builtin_RB2_SetState,  ///< Sets the pin direction to low impedance output (no state change)
    .Methods.Init           = &__builtin_RB2_Init,      ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
    .Methods.Dispose        = &__builtin_RB2_Dispose,   ///< Sets the pin to high impedance input (RESET default)
    .Methods.GetOpenDrain   = &__builtin_RB2_GetOpenDrain, ///< Gets the pin open drain mode
    .Methods.SetOpenDrain   = &__builtin_RB2_SetOpenDrain, ///< Sets the pin open drain mode
    .Methods.GetPullUp      = &__builtin_RB2_GetPullUp, ///< Gets the connection state of the pin's pull up resistor 
    .Methods.SetPullUp      = &__builtin_RB2_SetPullUp, ///< Sets the connection state of the pin's pull up resistor
    .Methods.GetPullDown    = &__builtin_RB2_GetPullDown, ///< Gets the connection state of the pin's pull down resistor
    .Methods.SetPullDown    = &__builtin_RB2_SetPullDown, ///< Sets the connection state of the pin's pull down resistor
    .Methods.SetAnalog      = &__builtin_RB2_SetAnalog, ///< Enable analog functions of this pin
    .Methods.SetDigital     = &__builtin_RB2_SetDigital ///< Disable analog functions of this pin
};
#endif // declarations of pin RB2

// Function declarations of port pin RB3
#if defined (_TRISB3)
static const P33C_GPIO_t PIN_RB3 = {
    .Properties.Port         = 1,                       ///< Index of device port this device pin is part of (0=A, 1=B, 2=C, 3=D, etc), =-1 if not available
    .Properties.Pin          = 3,                       ///< Index of device pin within its device port (0-15), =-1 if not available
    .Properties.RPid         = 35,                      ///< Remappable Pin ID of this device pin, =-1 if not available
    .Properties.ADCAN        = 8,                       ///< Index of ADC input instance available at this device pin, =-1 if not available
    .Properties.ADCORE       = 7,                       ///< Index of ADC core connected to analog input of this pin, valid range: 0 to 7, =-1 if not available
    .Properties.CMPxIN       = -1,                      ///< (not available)
    .Properties.DAC          = -1,                      ///< (not available)
    .Properties.I2C          = -1,                      ///< (not available)
    .Properties.OPA          = 2,                       ///< Index of Op-Amp peripheral instance available at this device pin, =-1 if not available
    .Properties.PGA          = -1,                      ///< (not available)
    .Properties.PG           = -1,                      ///< (not available)
    .Properties.SPI          = -1,                      ///< (not available)
    #if (P33C_DAC_COUNT > 0)
    .Objects.DAC             = NULL,                    ///< Pointer to DAC/Comparator instance data object available at this device pin
    #endif
    #if (P33C_I2C_COUNT > 0)
    .Objects.I2C             = NULL,                    ///< Pointer to I2C interface peripheral instance data object available at this device pin
    #endif
    #ifdef AMPCON2L
    .Objects.OPA             = (P33C_OPA_INSTANCE_t*)&AMPCON2L, ///< Pointer to Op-Amp instance data object available at this device pin
    #else
    .Objects.OPA             = NULL,                    ///< (not available)
    #endif
    #if (P33C_PGA_COUNT > 0)
    .Objects.PGA             = NULL,                    ///< Pointer to Programmable Gain Amplifier instance data object available at this device pin
    #endif
    #if (P33C_PG_COUNT > 0)
    .Objects.PG              = NULL,                    ///< Pointer to PWM Generator peripheral instance data object available at this device pin
    #endif
    #if (P33C_SPI_COUNT > 0)
    .Objects.SPI             = NULL,                    ///< Pointer to SPI interface peripheral instance data object available at this device pin
    #endif
    .Methods.Get            = &__builtin_RB3_Get,       ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
    .Methods.Set            = &__builtin_RB3_Set,       ///< Sets the most recent pin state to logic HIGH
    .Methods.Clear          = &__builtin_RB3_Clear,     ///< Sets the most recent pin state to logic LOW
    .Methods.Toggle         = &__builtin_RB3_Toggle,    ///< Toggles the most recent pin state
    .Methods.SetInput       = &__builtin_RB3_SetInput,  ///< Sets the pin direction to high impedance input (no state change)
    .Methods.SetOutput      = &__builtin_RB3_SetOutput, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.SetState       = &__builtin_RB3_SetState,  ///< Sets the pin direction to low impedance output (no state change)
    .Methods.Init           = &__builtin_RB3_Init,      ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
    .Methods.Dispose        = &__builtin_RB3_Dispose,   ///< Sets the pin to high impedance input (RESET default)
    .Methods.GetOpenDrain   = &__builtin_RB3_GetOpenDrain, ///< Gets the pin open drain mode
    .Methods.SetOpenDrain   = &__builtin_RB3_SetOpenDrain, ///< Sets the pin open drain mode
    .Methods.GetPullUp      = &__builtin_RB3_GetPullUp, ///< Gets the connection state of the pin's pull up resistor 
    .Methods.SetPullUp      = &__builtin_RB3_SetPullUp, ///< Sets the connection state of the pin's pull up resistor
    .Methods.GetPullDown    = &__builtin_RB3_GetPullDown, ///< Gets the connection state of the pin's pull down resistor
    .Methods.SetPullDown    = &__builtin_RB3_SetPullDown, ///< Sets the connection state of the pin's pull down resistor
    .Methods.SetAnalog      = &__builtin_RB3_SetAnalog, ///< Enable analog functions of this pin
    .Methods.SetDigital     = &__builtin_RB3_SetDigital ///< Disable analog functions of this pin
};
#endif // declarations of pin RB3

// Function declarations of port pin RB4
#if defined (_TRISB4)
static const P33C_GPIO_t PIN_RB4 = {
    .Properties.Port         = 1,                       ///< Index of device port this device pin is part of (0=A, 1=B, 2=C, 3=D, etc), =-1 if not available
    .Properties.Pin          = 4,                       ///< Index of device pin within its device port (0-15), =-1 if not available
    .Properties.RPid         = 36,                      ///< Remappable Pin ID of this device pin, =-1 if not available
    .Properties.ADCAN        = -1,                      ///< (not available)
    .Properties.ADCORE       = -1,                      ///< (not available)
    .Properties.CMPxIN       = -1,                      ///< (not available)
    .Properties.DAC          = -1,                      ///< (not available)
    .Properties.I2C          = -1,                      ///< (not available)
    .Properties.OPA          = 2,                       ///< Index of Op-Amp peripheral instance available at this device pin, =-1 if not available
    .Properties.PGA          = -1,                      ///< (not available)
    .Properties.PG           = -1,                      ///< (not available)
    .Properties.SPI          = -1,                      ///< (not available)
    #if (P33C_DAC_COUNT > 0)
    .Objects.DAC             = NULL,                    ///< Pointer to DAC/Comparator instance data object available at this device pin
    #endif
    #if (P33C_I2C_COUNT > 0)
    .Objects.I2C             = NULL,                    ///< Pointer to I2C interface peripheral instance data object available at this device pin
    #endif
    #ifdef AMPCON2L
    .Objects.OPA             = (P33C_OPA_INSTANCE_t*)&AMPCON2L, ///< Pointer to Op-Amp instance data object available at this device pin
    #else
    .Objects.OPA             = NULL,                    ///< (not available)
    #endif
    #if (P33C_PGA_COUNT > 0)
    .Objects.PGA             = NULL,                    ///< Pointer to Programmable Gain Amplifier instance data object available at this device pin
    #endif
    #if (P33C_PG_COUNT > 0)
    .Objects.PG              = NULL,                    ///< Pointer to PWM Generator peripheral instance data object available at this device pin
    #endif
    #if (P33C_SPI_COUNT > 0)
    .Objects.SPI             = NULL,                    ///< Pointer to SPI interface peripheral instance data object available at this device pin
    #endif
    .Methods.Get            = &__builtin_RB4_Get,       ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
    .Methods.Set            = &__builtin_RB4_Set,       ///< Sets the most recent pin state to logic HIGH
    .Methods.Clear          = &__builtin_RB4_Clear,     ///< Sets the most recent pin state to logic LOW
    .Methods.Toggle         = &__builtin_RB4_Toggle,    ///< Toggles the most recent pin state
    .Methods.SetInput       = &__builtin_RB4_SetInput,  ///< Sets the pin direction to high impedance input (no state change)
    .Methods.SetOutput      = &__builtin_RB4_SetOutput, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.SetState       = &__builtin_RB4_SetState,  ///< Sets the pin direction to low impedance output (no state change)
    .Methods.Init           = &__builtin_RB4_Init,      ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
    .Methods.Dispose        = &__builtin_RB4_Dispose,   ///< Sets the pin to high impedance input (RESET default)
    .Methods.GetOpenDrain   = &__builtin_RB4_GetOpenDrain, ///< Gets the pin open drain mode
    .Methods.SetOpenDrain   = &__builtin_RB4_SetOpenDrain, ///< Sets the pin open drain mode
    .Methods.GetPullUp      = &__builtin_RB4_GetPullUp, ///< Gets the connection state of the pin's pull up resistor 
    .Methods.SetPullUp      = &__builtin_RB4_SetPullUp, ///< Sets the connection state of the pin's pull up resistor
    .Methods.GetPullDown    = &__builtin_RB4_GetPullDown, ///< Gets the connection state of the pin's pull down resistor
    .Methods.SetPullDown    = &__builtin_RB4_SetPullDown, ///< Sets the connection state of the pin's pull down resistor
    .Methods.SetAnalog      = &__builtin_RB4_SetAnalog, ///< Enable analog functions of this pin
    .Methods.SetDigital     = &__builtin_RB4_SetDigital ///< Disable analog functions of this pin
};
